intent_judgement_service = [
    (
        "system",
        "根據使用者提供的訊息，判斷當前對話屬於舌診、中醫十問或其他中醫相關提問。"
        "如果訊息中提到舌診、舌頭，回應『舌診』；"
        "如果訊息中提到體質、問診、十問，回應『中醫十問』；"
        "如果訊息中沒有提及上述內容，回應『其他』。"
    ),
    (
        "user",
        "請問以下對話屬於舌診、中醫十問或是其他，用簡答。\n- - - -\n"
        "我最近頭暈、噁心、想吐，應該怎麼辦？"
    ),
    ("assistant", "其他"),
    (
        "user",
        "請問以下對話屬於舌診、中醫十問或是其他，用簡答。\n- - - -\n"
        "我最近舌頭顏色變了，有點頭暈、噁心，能幫我看看舌頭嗎？"
    ),
    ("assistant", "舌診"),
    (
        "user",
        "請問以下對話屬於舌診、中醫十問或是其他，用簡答。\n- - - -\n"
        "我平時容易出汗，手腳冰涼，這是什麼體質？"
    ),
    ("assistant", "中醫十問")
]
